/*
TODO :
    对战 :
        直接加入游戏 server不能只广播一次
        敌方方位指示器
        
    各种音效:
        获胜音效
        失败音效
        
        
    移植安卓(虚拟按键)
    战斗升级地图降低经验 增加随机宝箱
    技能更新:暗影迷踪(隐身)
    单人游戏BOSS
    技能更新:借力打力(反伤)
    
DONE :
    对战 :
        //基本移动
        //攻击&冲刺
        //击溃同步
        //生命同步
        //位置同步
        //结束条件
        //减小可移动空间
        //增加陷阱(毒地面和恢复地面)
    
    /*
    广域网联机方案: Hamachi!
        外网IP直连，无法穿透路由器，失败
        pptp vpn服务器+ddns，客户端无法直接通信，失败
        teamview自带vpn连接，成功，但是ping值太高
        Hamachi,暂时失败有待验证,双方关掉防火墙就行了!!!广域网联机成功!
    */    
        
    //各种音效:
        //背景音乐
        //脚步声
        //攻击音效
        //冲刺音效
        //获得经验
        //升级音效
        //受伤音效
        //M 键开关背景音乐
        //删除了背景音乐
        
    //版本验证
    //血量一百太少了,所以采取五倍血量
    //修复选择符文鼠标离开选项时的BUG
    //战斗升级时死亡返回按钮界面
